<template>
    <div id="aquaprint">
        <b-container>
            <h2>Аквапринт (иммерсионная печать)</h2>
            <p class="text">
                <b> Аквапринт (иммерсионная печать) </b> – инновационная технология переноса изображения на различные поверхности: пластмассу, дерево, фанеру, стекло, керамику, металлы.
            </p>
            <img src="../../../public/images/activity/aquaprint.jpg" class="descr_img" alt="Аквапринт">
            <p class="text">
            Технология иммерсионной печати позволяет любой Вашей детали обрести свой индивидуальный стиль, имитируя карбон, камуфляжную окраску, шкуры животных, ценные породы дерева, кожу рептилий и многие другие окрасы.
            </p>
            <p class="text">
                <u>Аквапринт позволяет декорировать детали, даже самой сложной формы с любым радиусом искривления: </u> электроника, бытовая техника, мебель, мобильные телефоны и аксессуары, автомобили, предметы интерьера и другие виды продукции.
            </p>
            <p class="text clear">
                Габариты изделия ограничиваются лишь <u> технологической ванной для аквапринта (1000x700мм) </u>
            </p>
            <p class="text">
                По Вашему желанию мы можем придать оригинальный внешний вид любой Вашей поверхности, добавив роскоши и эксклюзивности. За относительно небольшую плату Вы получаете более представительный внешний вид Вашего интерьера, который не блекнет, не стирается, не боится внешних воздействий и колебаний температур.
            </p>
            <h4>Процесс иммерсионной печати делится на ряд этапов:</h4>
            <div v-for="(service,index ) in  StepsService" :key="service.index">
                <service :index="index" :name_service="service .name_service" :description_service="service .description_service"
                         :img_service="service.img_service">
                </service>
            </div>
            <p class="price" v-html="aquaprint.price"></p>
            <p class="price">{{aquaprint.description}}</p>
        </b-container>
    </div>
</template>

<script>
    import Service from "../Service"
    import aquaprint from '../../../public/documents/prices/aquaprint/price_aquaprint.json';
    export default {
        name: "aquaprint",
        components: {Service},
        data() {
            return {
                aquaprint:aquaprint,
                StepsService: [
                    {
                        name_service: 'Подготовка поверхности изделия',
                        description_service: 'Изделие очищают, обезжиривают для обеспечения адгезии краски,' +
                        ' обрабатывают грунтовкой, убирают все неровности. При необходимости' +
                        ' покрывают небольшим слоем эмали для нужного оттенка.',
                        img_service: {
                            imgSrc:'./images/aquaprint/aquaprint_1.png',
                            imgAlt:'Подготовка_поверхности_изделия',
                        },
                    },
                    {
                        name_service: 'Работа с иммерсионной пленкой',
                        description_service: ' Подбирается расцветка и дизайн иммерсионной пленки. Пленка вырезается' +
                        ' по форме изделия, на которое наносится рисунок, с 5-10 сантиметрами запаса.' +
                        'Пленка опускается в ванну с водой, нагретой до нужной температуры (26-30°С),' +
                        ' растворимым слоем вниз. Выдерживается 1-2 минуты, устанавливаются' +
                        ' ограничительный рейки.',
                        img_service: {
                            imgSrc:'./images/aquaprint/aquaprint_2.jpg',
                            imgAlt:'Работа_с_иммерсионной_пленкой',
                        },
                    },
                    {
                        name_service: 'Распыление активатора',
                        description_service: ' На иммерсионную пленку зигзагообразным движением, на расстоянии 30' +
                        ' сантиметров от поверхности пленки, равномерно наносится активатор, не' +
                        ' допуская образования «тумана». Таким образом, мы придаем пленке мягкость' +
                        ' и пластичность.',
                        img_service: {
                            imgSrc:'./images/aquaprint/aquaprint_3.jpg',
                            imgAlt:'Распыление_активатора',
                        },
                    },
                    {
                        name_service: 'Перенос изображени и пост-обработка',
                        description_service: ' Подготовленное изделие, на котором печатают узор, опускается в воду, и' +
                        ' пленка обволакивает его. Для равномерного переноса изображения,' +
                        ' соблюдается определенный угол (45°) и скорость погружения в воду.' +
                        ' Декорированное изделие моют и сушат. Для продления срока службы' +
                        ' покрытия, на изделие наносят специальный лак (глянцевый / матовый) в' +
                        ' несколько слоев (количество определяется индивидуально) и полируют при' +
                        ' помощи специальной полировальной машины.',
                        img_service: {
                            imgSrc:'./images/aquaprint/aquaprint_4.jpg',
                            imgAlt:'Перенос_изображени_и_пост-обработка',
                        },
                    },
                ],
            }
        }
    }
</script>

<style scoped lang="scss">

</style>