<template>
    <div id="chrome_plating">
        <b-container>
        <h2>Химическая металлизация (хромирование)</h2>
        <p class="text">
           <b>Покрытие деталей хромом</b>  – процесс, в результате которого любая поверхность приобретает
            серебристо-зеркальный блеск, с помощью насыщения атомами хрома.
        </p>
            <b-row class="important_row">
                <b-col cols="5">
                    <iframe width="100%" height="100%" src="https://www.youtube.com/embed/2JgJ2FPrF8c"
                            frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                </b-col>
                <b-col>
                    <p class="text">
                       <u>Такая технология
                           устраняет небольшие дефекты на поверхности деталей и улучшает характеристики:</u>
                        повышаются антикоррозийные показатели, увеличивается твердость металла, улучшаются
                        защитные характеристики от эрозии, повышается жаропрочность, усиливается износостойкость,
                        снижается коэффициент трения и смачиваемость (адгезия к другим материалам), улучшается
                        внешний вид.
                    </p>
                    <p class="text">
                        При хромировании в производстве используется
                        <u>специализированная установка для химической
                            металлизации </u>. Уникальная конструкция позволяет
                        добиваться идеальных результатов за короткое время.
                    </p>
                </b-col>
            </b-row>
            <p class="text text_after_video">
                В производственной цикле используются современные
                нетоксичные реактивы, а значит хромирование может
                быть нанесено на любой предмет будь то автомобильный
                диск или вашу любимую вазу. Ведь благодаря импортным
                материалам гарантируется нанесение ровным слоем
                металлического покрытия с отличным эксплуатационным
                качеством.
            </p>
            <h4>Наши специалисты обладают огромным опытом и следуют всем необходимым этапам хромирования:</h4>
            <div v-for="(service,index ) in  StepsService" :key="service.index">
                <service :index="index" :name_service="service .name_service" :description_service="service .description_service"
                         :img_service="service.img_service">
                </service>
            </div>
            <div class="text">
                Такая технология защищает любую поверхность не один десяток лет без ощутимых потерь для
                внешнего вида. А значить ваша вещь будит радовать Вас долгие годы.
            </div>
            <p class="price">{{price_description}}</p>
            <p class="price" v-html="price_chrome"></p>
        </b-container>

    </div>
</template>

<script>
    import  price_chrome from '../../../public/documents/prices/chrome/price_chrome.json';
    import  price_description from '../../../public/documents/prices/chrome/price_description.json';
    import Service from "../Service"
    import price_aquaprint from "../../../public/documents/prices/aquaprint/price_aquaprint.json";
    export default {
        name: "chrome_plating",
        components: {Service},
        data() {
            return {
                price_chrome:price_chrome,
                price_description:price_description,
                StepsService: [
                    {
                        name_service: 'Подготовка, обжиг детали для достижения гидрофильных свойств, грунтование и химическое обезжиривание при\n' +
                        '                переделке изделия ',
                        description_service: ' Очистка поверхности изделия до стерильного и гладкого состояния ' +
                        ' детали, лакировка и сушка. А также обработка детали пламенем горелки,' +
                        ' что способствует улучшению адгезии базового лака и серебряного покрытия.',
                        img_service: {
                            imgSrc:'./images/chrome_1.png',
                            imgAlt:'Подготовка,_обжиг_и _химическое_обезжиривание',
                        },
                    },
                    {
                        name_service: 'Приготовление химии и нанесение активирующего состава на деталь',
                        description_service: 'Доведение химических реактивов до необходимой концентрации с помощью' +
                        ' дистиллированной воды. Распыление активатора на подготовленную поверхность до полного его' +
                        ' прилипания к детали, промывка поверхности дистиллированной водой от' +
                        ' излишков активатора..',
                        img_service: {
                            imgSrc:'./images/chrome_2.jpg',
                            imgAlt:'Приготовление_химии',
                        },
                    },
                    {
                        name_service: 'Покрытие ионами серебра и очистка',
                        description_service: '  Не допуская высыхания, с помощью двухсопельного пистолета (модификатора' +
                        ' и восстановителя), путем смешивания наносится тонкий слой серебра толщиной' +
                        ' 0,075-0,25 миллиметров. Очистка поверхности дистиллированной водой.',
                        img_service: {
                            imgSrc:'./images/chrome_3.png',
                            imgAlt:'Покрытие_ионами_серебра',
                        },
                    },
                    {
                        name_service: 'Сушка нанесенного серебряного слоя',
                        description_service: '  Сдув капелек воды с поверхности детали для предотвращения пятен' +
                        ' (с круглых деталей воду сдувают «от центра к краям»,' +
                        ' с плоских деталей «сверху вниз», с объемных деталей «сверху вниз и вращая» ), затем' +
                        ' происходит сушка в течении нескольких суток.',
                        img_service: {
                            imgSrc:'./images/chrome_4.jpg',
                            imgAlt:'Сушка_серебряного_слоя',
                        },
                    },
                    {
                        name_service: 'Нанесение специализированного воднодисперсионного грунта и покрытие лаком',
                        description_service: ' Сцепление двух слоев (серебро, лак). Придание цветовых оттенков детали с' +
                        ' помощью стойкого лака (в зависимости от поставленных целей может' +
                        ' наноситься до 15 слоев лака различных свойств).',
                        img_service: {
                            imgSrc:'./images/chrome_5.jpg',
                            imgAlt:'Покрытие_лаком',
                        },
                    },
                ],
            }
        }
    }
</script>

<style scoped lang="scss">

</style>