<template>
    <div id="drawing">
        <b-container>
            <h2>Нанесение графики на любые плоские поверхности с помощью УФ принтера</h2>
            <p class="text">
               <b>УФ-печать</b>  – нанесение изображения на поверхность изделия с помощью полимерных красок,
                мгновенно твердеющих при просвечивании лучами ультрафиолета. В процессе печати на
                поверхности распечатанного изображения образуется пленка, происходит процесс
                полимеризации, в результате чего изображения становятся чрезвычайно «прочными», что
                увеличивает срок эксплуатации на долгие годы.
            </p>
            <b-row class="important_row">
                <b-col cols="5">
                    <iframe width="100%" height="100%" src="https://www.youtube.com/embed/9q4nE9-V7m0"
                            frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                </b-col>
                <b-col>
                    <p class="text">
                       <u>Преимуществами УФ-печати является:</u>  яркая и стойкая
                        печать, нанесение полноцветного изображения на
                        любую плоскую поверхность без воздействия
                        температур с большим расширением, минимальные
                        затраты количества временных ресурсов и получение
                        огромного числа возможностей нанесения картинки на
                         металл, стекло, пластик, дерево, кафель, резину, кожу и прочее.
                    </p>
                    <p class="text">
                        Такой вид графики позволяет изготавливать привлекательные баннеры, афиши, плакаты,
                        информационные таблички и вывески, бизнес-подарки, промопродукцию и сувенирную продукцию с высокой детализацией и
                        однородным распределением краски.
                    </p>
                </b-col>
            </b-row>
            <p class="text text_after_video">
                Мы гарантируем использование самых качественных красок, которые благодаря защитной
                пленке в процессе печати сохраняют яркость даже при воздействии пыли, влаги, прямых
                солнечных лучей. Любые мелкие детали: контур, тень, отблеск, блик передаются максимально
                четко. Такой вид печати абсолютно экологически безопасен – компоненты (фотоинициаторы,
                олигомеры, мономеры, красители и специальные добавки (потокообразующие и разжижающие
                средства, антиоксиданты, стабилизаторы)) в составе чернил не имеют неприятного запаха и
                являются безвредными и неопасными для жизни и здоровья человека.
            </p>
            <h4>Процесс нанесения графики на любую плоскую твердую поверхность с помощью УФ-принтера
                делится на три небольшие стадии:</h4>
            <div v-for="(service,index ) in  StepsService" :key="service.index">
                <service :index="index" :name_service="service .name_service" :description_service="service .description_service"
                         :img_service="service.img_service">
                </service>
            </div>
            <h4>Прайс-лист:</h4>
            <p class="additional_information">
                Начальные расходы: 1000 рублей
            </p>
            <b-table  hover :items="pricelist__UV_printer"></b-table>
        </b-container>
    </div>
</template>

<script>
    import Service from "../Service";
    import  pricelist__UV_printer from '../../../public/documents/pricelist_UV_printer';
    export default {
        name: "drawing_with_a_UV_printer",
        components: {Service},
        data() {
            return {
                pricelist__UV_printer: pricelist__UV_printer,
                StepsService: [
                    {
                        name_service: 'Очистка места нанесения рисунка',
                        description_service: 'Для надежного сцепления изображения с поверхностью, изделие' +
                        ' очищают от микрочастиц пыли, жировых пленок, окислов и других загрязнений (обезжиривание).',
                        img_service: {
                            imgSrc:'./images/drawing_1.jpg',
                            imgAlt:'картинка',
                        },
                    },
                    {
                        name_service: 'Согласование с Заказчиком',
                        description_service: 'Чтобы рисунок не съехал с поверхности, изделие закрепляют на' +
                        ' принтере с помощью разнообразных материалов, в зависимости от' +
                        ' хрупкости и толщины материала изделия.',
                        img_service: {
                            imgSrc:'./images/drawing_2.png',
                            imgAlt:'картинка',
                        },
                    },
                    {
                        name_service: 'Нанесение рисунка с помощью лазерного гравера',
                        description_service: ' УФ-принтер распределяет чернила по поверхности выбранного изделия.' +
                        'По мере распределения чернил, над готовым изображением включаются' +
                        ' специальные для УФ-печати лампы, что обеспечивает мгновенное' +
                        ' высыхание изображения на поверхности изделия и не оставляет шансов' +
                        ' чернилам растечься или исказить рисунок.',
                        img_service: {
                            imgSrc:'./images/drawing_3.png',
                            imgAlt:'картинка',
                        },
                    },
                ],
            }
        }
    }
</script>
<style scoped lang="scss">

</style>