<template>
    <div id="laser">
        <b-container>
            <h2>Лазерная гравировка деревянных и пластиковых поверхностей</h2>
            <p class="text">
                <b> Лазерная гравировка </b> – современная технология нанесения изображения воздействием
                лазерного излучения, способствующая высокой детализации и долговечности изображений
            </p>
            <p class="text">
                Уникальность такой технологии состоит в высокой точности получаемого изображения и
                возможности нанести на поверхность изделия рисунок любых размеров. Достоинством же
                лазерной гравировки является отсутствие механического и теплового воздействия на изделие,
                что полностью исключает возможность какой-либо деформации.
            </p>
            <b-row class="important_row">
                <b-col cols="5">
                    <iframe width="100%" height="100%" src="https://www.youtube.com/embed/U91AHk_ZyI8"
                            frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                </b-col>
                <b-col>
                    <p class="text">
                    Гравировка по дереву и пластику происходит <u> с помощью
                    лазерного гравера </u>. Если материал однородный, то цвет
                    гравировки лишь слегка темнее цвета наружного слоя.
                    Нанесение лазером смотрится оригинально и органично,
                    что создает полное слияние с изделием.
                    </p>
                    <p class="text">
                        Такой <u> метод </u>
                    работы с материалом является <u>бесконтактным</u>,
                    благодаря чему удается достичь высокой скорости
                    работы и безупречного качества нанесенных
                    изображений.
                    </p>
                    <p class="text">
                    Лазерная гравировка создает абсолютно эксклюзивные аксессуары для офиса и дома с
                    неповторимым уникальным рисунком, скопировать которые практически невозможно.
                    Внешняя эстетика и очарование таких изделий не может оставить равнодушным никого!
                    </p>
                </b-col>
            </b-row>
            <p class="text text_after_video">
                Наши специалисты готовы реализовать Ваш проект точно в соответствии с техническим
                заданием, быстро и качественно. При необходимости мы разрабатываем под Ваши
                потребности дизайн-проект и согласовываем его с Вами до момента нанесения его на
                материал.
            </p>
            <h4>Технология лазерной гравировки:</h4>
            <div v-for="(service,index ) in  StepsService" :key="service.index">
                <service :index="index" :name_service="service .name_service" :description_service="service .description_service"
                :img_service="service.img_service">
                </service>
            </div>
            <h4>Прайс-лист:</h4>
            <b-table  hover :items="pricelist_laser"></b-table>
            <p class="additional_information">
                Цена указана в рублях за 1 см². Максимальный размер изображения 300х150 мм.
            </p>
        </b-container>
    </div>
</template>

<script>
    import Service from "../Service";
    import  pricelist_laser from '../../../public/documents/pricelist_laser';
    export default {
        name: "laser_engraving",
        components: {Service},
        data() {
            return {
                pricelist_laser: pricelist_laser,
                StepsService: [
                    {
                        name_service: 'Создание эскиза',
                        description_service: 'При помощи современного графического редактора (CorelDraw, Photoshop, AutoCAD, Illustrator, InkScape)' +
                        ' рисуется чертеж будущегоизображения. Все просчитывается до мельчайших деталей, чтобы гравировка была качественная и точная.',
                        img_service: {
                            imgSrc:'./images/laser_1.png',
                            imgAlt:'Создание_эскиза',
                        },
                    },
                    {
                        name_service: 'Согласование с Заказчиком',
                        description_service: 'Перед лазерной гравировкой, Заказчику показывается эскиз, вносятся и ' +
                        ' корректируются различные недостатки, дефекты, пожелания.',
                        img_service: {
                            imgSrc:'./images/laser_2.png',
                            imgAlt:'Согласование_с_Заказчиком',
                        },
                    },
                    {
                        name_service: 'Нанесение рисунка с помощью лазерного гравера',
                        description_service: ' На основании чертежа, в САМ-системе создается файл, в котором ' +
                        ' указывается точка начала гравировки, скорость перемещения ' +
                        ' инструмента и необходимая глубина погружения лазера в материал.' +
                        'Программу запускают на компьютере, присоединенном к граверу и' +
                        ' контролируют процесс лазерной гравировки.',
                        img_service: {
                            imgSrc:'./images/laser_3.jpg',
                            imgAlt:'Нанесение_рисунка_с_помощью_лазерного_гравера',
                        },
                    },
                ],
            }
        }
    }
</script>
<style scoped lang="scss">

</style>