<template>
    <div id="laser">
        <b-container>
            <h2>Лазерная гравировка деревянных и пластиковых поверхностей</h2>
            <p class="text"><b> Лазерная гравировка </b> – современная технология нанесения изображения воздействием лазерного излучения, способствующая высокой детализации и долговечности изображений</p>
            <img src="../../../public/images/activity/laser.jpg" class="descr_img" alt="Лазерная_гравировка"  rel="preload">
            <p class="text">Уникальность технологии состоит в высокой точности получаемого изображения и возможности нанести на поверхность изделия рисунок любых размеров. Отсутствует механическое и тепловое воздействия на изделие, что полностью исключает деформацию.</p>
            <p class="text">Гравировка по дереву и пластику происходит <u> с помощью лазерного гравера </u>. Если материал однородный, то цвет гравировки лишь слегка темнее цвета наружного слоя. Такой <u> метод </u>является <u>бесконтактным</u>, благодаря чему удается достичь высокой скорости работы и безупречного качества нанесенных изображений.</p>
            <p class="text clear">Лазерная гравировка создает абсолютно эксклюзивные аксессуары для офиса и дома с неповторимым уникальным рисунком, скопировать которые практически невозможно. Внешняя эстетика и очарование таких изделий не может оставить равнодушным никого!</p>
            <p class="text">Наши специалисты готовы реализовать Ваш проект точно в соответствии с техническим заданием, быстро и качественно. При необходимости мы разрабатываем под Ваши потребности дизайн-проект и согласовываем его с Вами до момента нанесения его на материал.</p>
            <h4>Технология лазерной гравировки:</h4>
            <div v-for="(service,index ) in  StepsService" :key="service.index">
                <service :index="index" :name_service="service .name_service" :description_service="service .description_service" :img_service="service.img_service"></service>
            </div>
            <h4>Прайс-лист:</h4>
            <b-table  hover :items="laser.price_table"></b-table>
            <p class="text">{{laser.description}}</p>
        </b-container>
    </div>
</template>

<script>
    import Service from "../Service";
    import laser from '../../../public/documents/prices/laser/price_laser.json';
    export default {
        name: "laser_engraving",
        components: {Service},
        data() {
            return {
                laser: laser,
                StepsService: [
                    {
                        name_service: 'Создание эскиза',
                        description_service: 'При помощи современного графического редактора (CorelDraw, Photoshop, AutoCAD, Illustrator, InkScape)' +
                            ' рисуется чертеж будущегоизображения. Все просчитывается до мельчайших деталей, чтобы гравировка была качественная и точная.',
                        img_service: {
                            imgSrc:'images/laser/laser_1.jpg',
                            imgAlt:'Создание_эскиза',
                        },
                    },
                    {
                        name_service: 'Согласование с Заказчиком',
                        description_service: 'Перед лазерной гравировкой, Заказчику показывается эскиз, вносятся и ' +
                            ' корректируются различные недостатки, дефекты, пожелания.',
                        img_service: {
                            imgSrc:'images/laser/laser_2.jpg',
                            imgAlt:'Согласование_с_Заказчиком',
                        },
                    },
                    {
                        name_service: 'Нанесение рисунка с помощью лазерного гравера',
                        description_service: ' На основании чертежа, в САМ-системе создается файл, в котором ' +
                            ' указывается точка начала гравировки, скорость перемещения ' +
                            ' инструмента и необходимая глубина погружения лазера в материал.' +
                            'Программу запускают на компьютере, присоединенном к граверу и' +
                            ' контролируют процесс лазерной гравировки.',
                        img_service: {
                            imgSrc:'images/laser/laser_3.jpg',
                            imgAlt:'Нанесение_рисунка_с_помощью_лазерного_гравера',
                        },
                    },
                ],
            }
        }
    }
</script>
<style scoped lang="scss">

</style>