<template>
    <div id="sandblasing">
        <b-container>
            <h2>Пескоструйная обработка</h2>
            <p class="text">
                <b> Пескоструйная обработка </b> – высокоэффективная технология очистки поверхности от
                коррозии, мазута, следов покатой окалины, нагара, масляных пятен, ржавчины, штукатурки,
                окаменевших нефтепродуктов и других разнообразных видов загрязнений с помощью
                абразива.
            </p>
            <p class="text">
                Такая обработка позволяет очищать не только
                металлические, каменные и бетонные поверхности,
                но даже такие хрупкие поверхности, как стекло.
                Данный метод обрабатывает поверхности как с
                большой площадью, так и точечно в труднодоступных
                местах, возвращая деталям блеск и новизну.
            </p>
            <p class="text">
                <u>Достоинствами пескоструйной обработки является: </u> высокое качество и скорость очистки,
                быстрое достижение результата, а также длительный эффект после очистки детали, что
                гарантирует длительность сохранения изделий без повреждений.
            </p>
            <p class="text">
                Наш цех оснащен самым современным оборудованием для
                осуществления пескоструйной очистки изделий.
                Все работы
                выполняются опытными и высококвалифицированными
                сотрудниками. Очистка поверхности изделия от загрязнений
                происходит с применением <u> пескоструйной камеры </u>.
            </p>
            <h4>Технология пескоструйной обработки в нашем цехе:</h4>
            <b-row class="important_row">
                <b-col cols="4">
                    <img src="../../../public/images/sandblasting/sandblasting_2.jpg" alt="Пескоструйная_камера_изнутри"/>
                </b-col>
                <b-col class="text">
                   В кабину камеры помещается деталь, специалисты нашей компании
                    просовывают руки в камеру, защищенные
                    специальными перчатками от абразива и включают
                    пескоструйную камеру с помощью педали. В кабине
                    зажигается свет, включается система вентиляции, из
                    сопла вылетают абразивные частицы. Происходит
                    обработка детали: специалист компании, придерживая
                    изделие, направляет шланг с соплом на очищаемую поверхность, абразивные частицы с
                    помощью сжатого воздуха получают большое ускорение, что приводит к тому, что грязь с
                    поверхности изделия буквально выбивается с поверхности этими частицами в считанные
                    минуты – происходит обдувка изделия с помощью обдувочного шланга сжатым воздухом.
                    После обработки и обдувки деталь достается.
                </b-col>
            </b-row>
            <h4>Прайс-лист:</h4>
            <b-table  hover :items="sandblasting.price_table"></b-table>
            <p class="text">{{sandblasting.description}}</p>
        </b-container>
    </div>
</template>

<script>
    import  sandblasting from '../../../public/documents/prices/sandblasting/price_sandblasting.json';
    export default {
        name: "sandblasing",
        data() {
            return {
                sandblasting:sandblasting,
            }
        }
    }
</script>
<style scoped lang="scss">

</style>